 /***
    Author: Mario J. Martin <dominonurbs$gmail.com>

    Methods for importing NURBS curves and surfaces from an IGES file

*******************************************************************************/


#include <stdio.h>
#include <string.h>
#include <stdlib.h>

#include "nurbs_internal.h"
#include "nurbs_curve.h"
#include "nurbs_surface.h"

#include "domino_nurbs.h" /* TAKE THIS OUT */

/* Parameters readed from the global section */
typedef struct 
{
    char parameter_delimiter_character;         /* 1 */
    char record_delimiter_character;            /* 2 */
    char product_identification[256];           /* 3 */
    char filename[256];                         /* 4 */
    char native_system_id[256];                 /* 5 */
    char preprocessor_version[256];             /* 6 */
    int num_bits_integer;                       /* 7 */
    int max_power_single;                       /* 8 */
    int number_significat_bits_single;          /* 9 */
    int max_power_double;                       /* 10 */
    int number_significat_bits_double;          /* 11 */
    char product_identification_receiving[256]; /* 12 */
    float model_space_scale;                   /* 13 */
    int units_flag;                             /* 14 */
    char units_name[256];                       /* 15 */
    int num_line_weights_gradation;             /* 16 */
    float max_line_weight;                     /* 17 */
    char file_data_time_generation[256];        /* 18 */
    float granularity;                         /* 19 */
    float max_ccordinate_value;                /* 20 */
    char authors_name[256];                     /* 21 */
    char authors_organization[256];             /* 22 */
    int file_version;                           /* 23 */
    int drafting_standard;                      /* 24 */
    char file_data_time_modification[256];      /* 25 */
    char application_protocol[256];             /* 26 */

}GlobalSectionFields;


typedef struct 
{
    int entity_type_number; /* 126 nurbs_curve; 128 nurbs_surface */
    int data_line;          /* line in the IGES file with the parameter data */
    int form;               /* 0 is for rational B-spline parameters */
    char label[9];          /* Entity label */
    int subscript;          /* Entity subscript number */
    NurbsCurve* curve;      /* if it is a curve, data is stored here */
    NurbsSurface* surface;  /* if it is a surface, data is stored here*/
}Entity;


/******************************************************************************/

typedef struct _DynamicStack
{
    struct _DynamicStack *next; /* Pointer to the next element of the stack */
    struct _DynamicStack *from; /* Pointer to the previous element */
    void *data;                 /* Pointer to the data */
} DynamicStack;

/** Creates a token */
static DynamicStack* dynamic_stack_create_token(void)
{
